# Yosys synthesis script for FWFT Synchronous FIFO

# Read Sky130 library
read_liberty -lib \
/usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hdll/lib/sky130_fd_sc_hdll__tt_025C_1v80.lib

# Read RTL
read_verilog -sv rtl/sync_fifo.sv

# Set top module
hierarchy -top sync_fifo -chparam FWFT 1

# Synthesis
proc
opt
fsm
opt
memory
opt
techmap
opt

# Technology mapping
dfflibmap \
-liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hdll/lib/sky130_fd_sc_hdll__tt_025C_1v80.lib

abc \
-liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hdll/lib/sky130_fd_sc_hdll__tt_025C_1v80.lib

clean

# Reports
stat \
-liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hdll/lib/sky130_fd_sc_hdll__tt_025C_1v80.lib

check

# Write synthesized netlist
write_verilog reports/fwft_fifo_sky130_synth.v